#1)

ls =["someone", 110, 11.0, False, 11, "hello", "hi", 10, "good", True] #ეს არის ლისტი, ლისტში შედის ყველაფერი რასაც მასში ჩაწერ


print(len(ls)) #ეს კი თვლის რამდენი რამ არის ლისტში, მაგალითად ლისტში არის 10 ელემენტი (10 ნივთი ყუთში), ეს კოდი
#ითვლის რამდენი ელემენტია ყუთში, ამ შემთხვევაში გამოგიტანს 10-ს

#2)

sl =["someone", 10, 1.0, True, 12, "why?", "gooddd", 11, "good", True] # ესეც ლისტია

for i in range(9): #ეს ვერ გავიგე
    print(sl[1])
    #???
    
#3)

ls =["someone", 110, 11.0, False, 11, "hello", "hi", 10, "good", True]
ls.append(False)
# ეს ფუნქცია ამატებს ამ ლისტს რასაც შიგნით ფრჩხილებში ჩაწერ
print(ls)

#4)

for i in range (10):
    ls.append(i)   # ამ კოდით მე დავამეტე 10 ელემენტი ამ ლისტს, ეს კოდი გიპრინტავს იმდენ ციფრს რამდენიც range-ში გიწერია,
print(ls)          #append-ფუნქციით მე ეს 10 რიცხვი დავამატე ლისტს



